daniel-0723/STM32CubeMX/Files/Drivers/QSPI Flash driver/stm32xxx_qspi_MXIC.c
/*************************************************************************************************
 *          Macronix xSPI-NOR Flash BSP driver
 * @file    stm32xxx_QUADSPI_MXIC.c
 * @brief   Macronix xSPI-NOR Flash BSP driver for STM32 QUASDPI IP.
 * @Author  Peter Chang / Macronix; peterchang01@mxic.com.tw
 *************************************************************************************************
 * History :
 * 2023/12/20 Release V2.0.0
 *            Rename stm32f769i_discovery_qspi_MXIC.h to stm32xxx_qspi_MXIC.h
 *            Rename stm32f769i_discovery_qspi_MXIC.c to stm32xxx_qspi_MXIC.c
 *            Remove USE_AUTO_DC_CONFIGURATION define
 *            Alignment BSP input parameter between QUAD-SPI & OCTO-SPI IP
 *            Move BSP_QSPI_ReadConfigurationRegister2() & BSP_QSPI_WriteConfigurationRegister2()
 *            form stm32xxx_qspi_MXIC_ex.c to stm32xxx_qspi_MXIC.c
 * 2023/01/30 Release V1.2.0
 * 2023/01/10 Change software reset procedure in BSP_QSPI_ResetMemory()
 * 2022/12/27 Add function to check if device support required mode in BSP_QSPI_SetFlashInterface()
 * 2022/12/12 Release V1.1.0
 * 2022/12/08 Rename to stm32xxx_QUADSPI_MXIC.c from stm32f769i_discovery_qspi_MXIC.c
 *            Add procedure to check if device is Macronix parts but driver not match.
 * 2022/10/06 Move RPMC functions to stm32f769i_discovery_qspi_MXIC_ex.c
 * 2022/06/17 Release V1.0.1
 *            Remove test functions
 * 2022/06/15 Release V1.0.0
 * 2021/12/09 Initial version.
 *************************************************************************************************/
/* Includes ------------------------------------------------------------------*/
#include "stm32xxx_qspi_MXIC.h"

/*******************************************************************************
 * QUADSPI IP support Dual-Quad Flash access
 * This driver use Instance 0 to access single Quad Flash via BK1 only.
 ******************************************************************************/
QSPI_HandleTypeDef QSPIHandle[QSPI_NOR_INSTANCE_NUMBER];
QSPI_Ctx_t            QSPICtx[QSPI_NOR_INSTANCE_NUMBER] = {0};

#ifdef MXIC_SNOR_CR_ODS
static uint32_t QSPI_SetODS(uint32_t Instance, uint8_t ODS);
#endif  // MXIC_SNOR_CR_ODS

#if defined(MXIC_SNOR_CR_DC) || defined(MXIC_SNOR_CR2_DC)
static uint32_t QSPI_DummyCyclesCfg(uint32_t Instance, uint8_t DCIndex);
#endif

/*******************************************************************************
 * Export Functions
 ******************************************************************************/
/**
  * @brief  Initializes the QSPI interface.
  * @param  Instance   QSPI Instance
  *         Init       QSPI Init structure
  * @retval BSP status
  */
uint32_t BSP_QSPI_Init(uint32_t Instance, BSP_QSPI_Init_t Init)
{
    BSP_QSPI_Info_t Info;

    /* STM32 QSPI interface initialization */
    (void)MXIC_SNOR_GetDriverInfo(&Info);

    if(BSP_QSPI_ResetMemory(Instance) != BSP_ERROR_NONE)
    {
      return BSP_ERROR_COMPONENT_FAILURE;
    }
    else
    {
#if 0   /* Check if device match driver */
      MXIC_SNOR_CommandHandle_t IDCommandHandle;

      IDCommandHandle.Mode             = QSPICtx[Instance].InterfaceMode;
      IDCommandHandle.Parameter.Type32 = 0;
      IDCommandHandle.pBuffer          = IDCommandHandle.Parameter.Type8;
      if(MXIC_SNOR_ReadID(&QSPIHandle[Instance], &IDCommandHandle) != MXIC_SNOR_ERROR_NONE)
      {
        return BSP_ERROR_COMPONENT_FAILURE;
      }
      else if(IDCommandHandle.Parameter.Type32 != Info.ID)
      {
        // Check if this is a Macronix parts
        if(IDCommandHandle.Parameter.Type8[0] == MXIC_SNOR_MEMORY_MANUFACTURER_ID) return BSP_ERROR_DRIVER_NOT_MATCH_DEVICE;
        else                                                                       return BSP_ERROR_UNKNOWN_COMPONENT;
      }
#endif

#ifdef MXIC_SNOR_SR_QE
      // Always turn on QE bit to change pin function in I/O mode.
      // If pin H/W function used then user may remove this routine.
      MXIC_SNOR_CommandHandle_t CommandHandle;
      MXIC_SNOR_StatusRegister_t SReg;

      /* Read Status Register, Fore Flash QE bit = 1; Disable WP# pin function */
      CommandHandle.Mode    = QSPICtx[Instance].InterfaceMode;
      CommandHandle.pBuffer = (uint8_t *)&SReg;
      if(MXIC_SNOR_ReadStatusRegister(&QSPIHandle[Instance], &CommandHandle) != MXIC_SNOR_ERROR_NONE)
      {
        return BSP_ERROR_COMPONENT_FAILURE;
      }
      else
      {
        /* Write Status Register, Fore Flash QE bit = 1; Disable WP# pin function */
        SReg.QE = 1;

        if(BSP_QSPI_WriteStatusRegister(Instance, SReg) != BSP_ERROR_NONE)
        {
          return BSP_ERROR_COMPONENT_FAILURE;
        }
      }
#endif  // MXIC_SNOR_SR_QE

#if defined(MXIC_SNOR_CR_DC) || defined(MXIC_SNOR_CR2_DC)
      if(QSPI_DummyCyclesCfg(Instance, DC_INDEX) != BSP_ERROR_NONE)
      {
        return BSP_ERROR_COMPONENT_FAILURE;
      }
#endif  // defined(MXIC_SNOR_CR_DC) || defined(MXIC_SNOR_CR2_DC)

#ifdef MXIC_SNOR_CR_ODS
      /* Configuration of the Output driver strength on memory side. Modify ODS_INDEX in include file. */
      if(QSPI_SetODS(Instance, ODS_INDEX) != BSP_ERROR_NONE)
      {
        return BSP_ERROR_COMPONENT_FAILURE;
      }
#endif  // MXIC_SNOR_CR_ODS

#ifdef SUPPORT_34BYTE_ADDRESS_SWITCH
      /* If support 4 Byte address switch command then force command use 4 Byte address */
      if(MXIC_SNOR_Enter4BytesAddressMode(&QSPIHandle[Instance], QSPICtx[Instance].InterfaceMode) != MXIC_SNOR_ERROR_NONE)
      {
        return BSP_ERROR_COMPONENT_FAILURE;
      }
#endif  // SUPPORT_34BYTE_ADDRESS_SWITCH

      /* Configure Flash to desired Interface */
      if(BSP_QSPI_SetFlashInterface(Instance, Init) != BSP_ERROR_NONE)
      {
        return BSP_ERROR_COMPONENT_FAILURE;
      }
    }
  /* Return BSP status */
  return BSP_ERROR_NONE;
}

/**
  * @brief  De-Initializes the QSPI interface.
  * @param  Instance   QSPI Instance
  * @retval BSP status
  */
uint32_t BSP_QSPI_DeInit(uint32_t Instance)
{
  uint32_t ret = BSP_ERROR_NONE;

