daniel-0723/STM32CubeMX/Files/Drivers/QSPI Flash driver/stm32xxx_qspi_MXIC.c
  /* Check if the instance is supported */
  if(Instance >= QSPI_NOR_INSTANCE_NUMBER)
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  else
  {
    /* Disable Memory mapped mode */
    if(QSPICtx[Instance].IsInitialized == QSPI_ACCESS_MMP)
    {
      if(BSP_QSPI_DisableMemoryMappedMode(Instance) != BSP_ERROR_NONE)
      {
        ret = BSP_ERROR_COMPONENT_FAILURE;
      }
    }

    /* Set default QSPICtx values even previous process failed ! */
    QSPICtx[Instance].IsInitialized      = QSPI_ACCESS_NONE;
    QSPICtx[Instance].InterfaceMode.IO   = MXIC_SNOR_FREAD_111;
    QSPICtx[Instance].InterfaceMode.Rate = MXIC_SNOR_STR;

#if (USE_HAL_QSPI_REGISTER_CALLBACKS == 0)
    QSPI_MspDeInit(&QSPIHandle[Instance]);
#endif /* (USE_HAL_QSPI_REGISTER_CALLBACKS == 0) */

    /* Call the DeInit function to reset the driver */
    if (HAL_QSPI_DeInit(&QSPIHandle[Instance]) != HAL_OK)
    {
      ret = BSP_ERROR_BUS_FAILURE;
    }
  }
  /* Return BSP status */
  return ret;
}

#if (USE_HAL_QSPI_REGISTER_CALLBACKS == 1)
/**
  * @brief Default BSP QSPI Msp Callbacks
  * @param Instance      QSPI Instance
  * @retval BSP status
  */
uint32_t BSP_QSPI_RegisterDefaultMspCallbacks (uint32_t Instance)
{
  uint32_t ret = BSP_ERROR_NONE;

  /* Check if the instance is supported */
  if(Instance >= QSPI_NOR_INSTANCE_NUMBER)
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  else
  {
    /* Register MspInit/MspDeInit Callbacks */
    if((HAL_QSPI_RegisterCallback(&QSPIHandle[Instance], HAL_QSPI_MSPINIT_CB_ID, QSPI_MspInit) != HAL_OK) ||
       (HAL_QSPI_RegisterCallback(&QSPIHandle[Instance], HAL_QSPI_MSPDEINIT_CB_ID, QSPI_MspDeInit) != HAL_OK))
    {
      ret = BSP_ERROR_PERIPH_FAILURE;
    }
    else
    {
      QSPICtx[Instance].IsMspCallbacksValid = 1;
    }
  }
  /* Return BSP status */
  return ret;
}

/**
  * @brief BSP QSPI Msp Callback registering
  * @param Instance     QSPI Instance
  * @param CallBacks    pointer to MspInit/MspDeInit callbacks functions
  * @retval BSP status
  */
uint32_t BSP_QSPI_RegisterMspCallbacks (uint32_t Instance, BSP_QSPI_Cb_t *CallBacks)
{
  uint32_t ret = BSP_ERROR_NONE;

  /* Check if the instance is supported */
  if(Instance >= QSPI_NOR_INSTANCE_NUMBER)
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  else
  {
    /* Register MspInit/MspDeInit Callbacks */
    if((HAL_QSPI_RegisterCallback(&QSPIHandle[Instance], HAL_QSPI_MSPINIT_CB_ID, (pQSPI_CallbackTypeDef)CallBacks->pMspInitCb) != HAL_OK) ||
       (HAL_QSPI_RegisterCallback(&QSPIHandle[Instance], HAL_QSPI_MSPDEINIT_CB_ID, (pQSPI_CallbackTypeDef)CallBacks->pMspDeInitCb) != HAL_OK))
    {
      ret = BSP_ERROR_PERIPH_FAILURE;
    }
    else
    {
      QSPICtx[Instance].IsMspCallbacksValid = 1;
    }
  }
  /* Return BSP status */
  return ret;
}
#endif /* (USE_HAL_QSPI_REGISTER_CALLBACKS == 1) */

/**
  * @brief  Return the driver information
  * @param  Instance  QSPI instance
  *         pInfo     pointer on the driver information structure
  * @retval BSP status
  */
uint32_t BSP_QSPI_GetInfo(uint32_t Instance, BSP_QSPI_Info_t *pInfo)
{
  uint32_t ret = BSP_ERROR_NONE;

  /* Check if the instance is supported */
  if(Instance >= QSPI_NOR_INSTANCE_NUMBER)
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  else
  {
    (void)MXIC_SNOR_GetDriverInfo(pInfo);
  }
  /* Return BSP status */
  return ret;
}

/**
  * @brief  Reads current status of the QSPI memory.
  *         If WIP != 0 then return busy.
  * @param  Instance  QSPI instance
  * @retval QSPI memory status: whether busy or not
  */
uint32_t BSP_QSPI_GetStatus(uint32_t Instance)
{
  uint32_t ret;
  MXIC_SNOR_StatusRegister_t SReg;

  ret = BSP_QSPI_ReadStatusRegister(Instance, &SReg);
  if(ret == BSP_ERROR_NONE)
  {
    if(SReg.WIP)
    {
      ret = BSP_ERROR_BUSY;
    }
  }
  /* Return BSP status */
  return ret;
}

/**
  * @brief  Set Flash to desired Interface mode. And this instance becomes current instance.
  *         If current instance running at MMP mode then exit to indirect mode.
  *         MCU is running at Indirect mode always, after call this function.
  *         SPI/QPI change mode     : Issue 1-x-x EQIO <-> 4-x-x RSTQIO
  *         Octal Flash change mode : 8-8-8/STR <-> 1-1-1-STR <-> 8-8-8/DTR
  * @param  Instance  OSPI_NOR instance
  *         Init      Flash I/O & transfer rate configuration
  * @retval BSP status
  */
uint32_t BSP_QSPI_SetFlashInterface(uint32_t Instance, BSP_QSPI_Init_t Init)
{
  uint32_t ret = BSP_ERROR_NONE;

  /* Check if the instance is supported */
  if(Instance >= QSPI_NOR_INSTANCE_NUMBER)
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  else
  {
    /* Check if device support required mode *************************************/
    switch(Init.IO)
    {
    default :                       // Quad-SPI IP not support 1-1-8/8-8-8 I/O
    //case MXIC_SNOR_FREAD_118 :    // 1-1-8 fast read command or Parallel mode command;                 0x03, 0x7C
    //case MXIC_SNOR_FREAD_888 :    // 8-8-8 fast read Octal command, MCU QSPI IP not support this mode; 0x7C, 0xEC, 0xEE
      ret = BSP_ERROR_WRONG_PARAM;
      break;

    case MXIC_SNOR_NREAD_111 :      // 1-1-1 normal read command with 0 dummy cycle;          0x03, 0x13
      if(Init.Rate == MXIC_SNOR_STR)
      {
#if !defined(MXIC_SNOR_NORMAL_READ_111_CMD) && !defined(MXIC_SNOR_4BYTE_ADDRESS_NORMAL_READ_111_CMD)
        ret = BSP_ERROR_WRONG_PARAM;
#endif
      }
      else ret = BSP_ERROR_WRONG_PARAM;
      break;

    case MXIC_SNOR_FREAD_111 :      // 1-1-1 fast read command, Power on H/W default setting; 0x0B, 0x0C, 0x0D, 0x0E
      if(Init.Rate == MXIC_SNOR_STR)
      {
#if !defined(MXIC_SNOR_FAST_READ_111_CMD) && !defined(MXIC_SNOR_4BYTE_ADDRESS_FAST_READ_111_CMD)
        ret = BSP_ERROR_WRONG_PARAM;
#endif
      }
      else
      {
#if !defined(MXIC_SNOR_FAST_READ_111_DTR_CMD) && !defined(MXIC_SNOR_4BYTE_ADDRESS_FAST_READ_111_DTR_CMD)
        ret = BSP_ERROR_WRONG_PARAM;
#endif
      }
      break;

    case MXIC_SNOR_FREAD_112 :      // 1-1-2 fast read command;                               0x3B, 0x3C
      if(Init.Rate == MXIC_SNOR_STR)
      {
#if !defined(MXIC_SNOR_FAST_READ_112_CMD) && !defined(MXIC_SNOR_4BYTE_ADDRESS_FAST_READ_112_CMD)
        ret = BSP_ERROR_WRONG_PARAM;
#endif
      }
      else ret = BSP_ERROR_WRONG_PARAM;
      break;

    case MXIC_SNOR_FREAD_114 :      // 1-1-4 fast read command;                               0x6B, 0x6C
      if(Init.Rate == MXIC_SNOR_STR)
      {
#if !defined(MXIC_SNOR_FAST_READ_114_CMD) && !defined(MXIC_SNOR_4BYTE_ADDRESS_FAST_READ_114_CMD)
      ret = BSP_ERROR_WRONG_PARAM;
#endif
      }
      else ret = BSP_ERROR_WRONG_PARAM;
      break;

    case MXIC_SNOR_FREAD_122 :      // 1-2-2 fast read command;                               0xBB, 0xBC, 0xBD, 0xBE
      if(Init.Rate == MXIC_SNOR_STR)
      {
#if !defined(MXIC_SNOR_FAST_READ_122_CMD) && !defined(MXIC_SNOR_4BYTE_ADDRESS_FAST_READ_122_CMD)
        ret = BSP_ERROR_WRONG_PARAM;
#endif
      }
      else
      {
#if !defined(MXIC_SNOR_FAST_READ_122_DTR_CMD) && !defined(MXIC_SNOR_4BYTE_ADDRESS_FAST_READ_122_DTR_CMD)
        ret = BSP_ERROR_WRONG_PARAM;
#endif
      }
      break;

    case MXIC_SNOR_FREAD_144 :      // 1-4-4 fast read command;                               0xEA, 0xEB, 0xEC, 0xED, 0xEE
      if(Init.Rate == MXIC_SNOR_STR)
      {
#if !defined(MXIC_SNOR_FAST_READ_144_CMD) && !defined(MXIC_SNOR_4BYTE_ADDRESS_FAST_READ_144_CMD)
        ret = BSP_ERROR_WRONG_PARAM;
#endif
      }
      else
      {
#if !defined(MXIC_SNOR_FAST_READ_144_DTR_CMD) && !defined(MXIC_SNOR_4BYTE_ADDRESS_FAST_READ_144_DTR_CMD)
        ret = BSP_ERROR_WRONG_PARAM;
#endif
      }
      break;

