daniel-0723/STM32CubeMX/Files/Drivers/QSPI Flash driver/stm32xxx_qspi_MXIC.c
    case MXIC_SNOR_FREAD_144_4DC :  // 1-4-4 fast read command with 4 dummy clock;            0xE7
      if(Init.Rate == MXIC_SNOR_STR)
      {
#if !defined(MXIC_SNOR_FAST_READ_144_4DC_CMD)
        ret = BSP_ERROR_WRONG_PARAM;
#endif
      }
      else ret = BSP_ERROR_WRONG_PARAM;
      break;

    case MXIC_SNOR_FREAD_444 :      // 4-4-4 fast read QPI command;                           0xEA, 0xEB, 0xEC, 0xED, 0xEE
      if(Init.Rate == MXIC_SNOR_STR)
      {
#if !defined(MXIC_SNOR_FAST_READ_444_CMD) && !defined(MXIC_SNOR_4BYTE_ADDRESS_FAST_READ_444_CMD)
        ret = BSP_ERROR_WRONG_PARAM;
#endif
      }
      else
      {
#if !defined(MXIC_SNOR_FAST_READ_444_DTR_CMD) && !defined(MXIC_SNOR_4BYTE_ADDRESS_FAST_READ_444_DTR_CMD)
        ret = BSP_ERROR_WRONG_PARAM;
#endif
      }
      break;

    case MXIC_SNOR_FREAD_444_4DC :  // 4-4-4 fast read QPI command with 4 dummy clock;        0x0B, 0xE7
      if(Init.Rate == MXIC_SNOR_STR)
      {
#if !defined(MXIC_SNOR_FAST_READ_444_4DC_CMD)
        ret = BSP_ERROR_WRONG_PARAM;
#endif
      }
      else ret = BSP_ERROR_WRONG_PARAM;
      break;
    }
    if(ret != BSP_ERROR_NONE) return ret;

    /* Check if MCU running MMP mode *********************************************/
    if(QSPICtx[Instance].IsInitialized == QSPI_ACCESS_MMP)
    {
      /* Abort MMP back to indirect mode */
      if(HAL_QSPI_Abort(&QSPIHandle[Instance]) != HAL_OK) return BSP_ERROR_INSTANCE_MMP_UNLOCK_FAILURE;
      else QSPICtx[Instance].IsInitialized = QSPI_ACCESS_INDIRECT;
    }

    /* Setup Flash interface ***************************************************/
    switch(QSPICtx[Instance].InterfaceMode.IO)
    {
    default :                     // Quad-SPI IP not support 1-1-8/8-8-8 I/O
    //case MXIC_SNOR_FREAD_118 :  // 1-1-8 fast read command, MCU QSPI IP not support this mode         0x03, 0x7C
    //case MXIC_SNOR_FREAD_888 :  // 8-8-8 fast read Octal command, MCU QSPI IP not support this mode   0x7C, 0xEC, 0xEE
      ret = BSP_ERROR_WRONG_PARAM;
      break;

    case MXIC_SNOR_NREAD_111 :      // 1-1-1 normal read command with 0 dummy cycle             0x03, 0x13
    case MXIC_SNOR_FREAD_111 :      // 1-1-1 fast read command, Power on H/W default setting    0x0B, 0x0C, 0x0D, 0x0E
    case MXIC_SNOR_FREAD_112 :      // 1-1-2 fast read command                                  0x3B, 0x3C
    case MXIC_SNOR_FREAD_114 :      // 1-1-4 fast read command                                  0x6B, 0x6C
    case MXIC_SNOR_FREAD_122 :      // 1-2-2 fast read command                                  0xBB, 0xBC, 0xBD, 0xBE
    case MXIC_SNOR_FREAD_144 :      // 1-4-4 fast read command                                  0xEA, 0xEB, 0xEC, 0xED, 0xEE
    case MXIC_SNOR_FREAD_144_4DC :  // 1-4-4 fast read command with 4 dummy clock;              0xE7
      if((Init.IO == MXIC_SNOR_FREAD_444) || (Init.IO == MXIC_SNOR_FREAD_444_4DC))
      {
#ifdef SUPPORT_QPI
        if(MXIC_SNOR_EnterQPIMode(&QSPIHandle[Instance]) != MXIC_SNOR_ERROR_NONE)
        {
           ret = BSP_ERROR_COMPONENT_FAILURE;
        }
#else
        ret = BSP_ERROR_WRONG_PARAM;
#endif  // SUPPORT_QPI
      }
      break;

#ifdef SUPPORT_QPI
    case MXIC_SNOR_FREAD_444 :      // 4-4-4 fast read QPI command                              0xEA, 0xEB, 0xEC, 0xED, 0xEE
    case MXIC_SNOR_FREAD_444_4DC :  // 4-4-4 fast read QPI command with 4 dummy clock; 0xE7     0x0B, 0xE7
      if((Init.IO != MXIC_SNOR_FREAD_444) && (Init.IO != MXIC_SNOR_FREAD_444_4DC))
      {
        if(MXIC_SNOR_ExitQPIMode(&QSPIHandle[Instance]) != MXIC_SNOR_ERROR_NONE)
        {
          ret = BSP_ERROR_COMPONENT_FAILURE;
        }
      }
      break;
#endif  // SUPPORT_QPI
    }

    /* Update QSPI context if all operations are well done */
    if(ret == BSP_ERROR_NONE)
    {
      /* Update current status parameter *****************************************/
      QSPICtx[Instance].IsInitialized = QSPI_ACCESS_INDIRECT;
      QSPICtx[Instance].InterfaceMode = Init;
    }
  }
  /* Return BSP status */
  return ret;
}

/**
  * @brief  Get current Flash interface setting
  * @param  Instance  QSPI instance
  * @retval BSP status
  *         pInit     Flash I/O & transfer rate configuration
  */
uint32_t BSP_QSPI_GetFlashInterface(uint32_t Instance, BSP_QSPI_Init_t *pInit)
{
  uint32_t ret = BSP_ERROR_NONE;

  /* Check if the instance is supported */
  if(Instance >= QSPI_NOR_INSTANCE_NUMBER)
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  else
  {
    *pInit = QSPICtx[Instance].InterfaceMode;
  }

  return ret;
}

/**
  * @brief  Configure the QSPI in memory-mapped mode
  *         Only 1 Instance can running MMP mode. And it will lock system at this mode.
  * @param  Instance  QSPI instance
  * @retval BSP status
  */
uint32_t BSP_QSPI_EnableMemoryMappedMode(uint32_t Instance)
{
  uint32_t ret = BSP_ERROR_NONE;

  /* Check if the instance is supported */
  if(Instance >= QSPI_NOR_INSTANCE_NUMBER)
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  else
  {
#ifdef SUPPORT_DTR
    if(QSPICtx[Instance].InterfaceMode.Rate == MXIC_SNOR_DTR)
    {
      // DTR read, Set sampling shift none
      QSPIHandle[Instance].Init.SampleShifting = QSPI_SAMPLE_SHIFTING_NONE;

      if(HAL_QSPI_Init(&QSPIHandle[Instance])!= HAL_OK)
      {
        ret = BSP_ERROR_PERIPH_FAILURE;
      }
      else if(MXIC_SNOR_EnableMemoryMappedModeDTR(&QSPIHandle[Instance], QSPICtx[Instance].InterfaceMode) != MXIC_SNOR_ERROR_NONE)
      {
        // MMP DTR read initial fail, Set sampling shift back to half cycle
        QSPIHandle[Instance].Init.SampleShifting = QSPI_SAMPLE_SHIFTING_HALFCYCLE;
        HAL_QSPI_Init(&QSPIHandle[Instance]);

        ret = BSP_ERROR_COMPONENT_FAILURE;
      }
    }
    else
#endif  // SUPPORT_DTR
    {
      if(MXIC_SNOR_EnableMemoryMappedModeSTR(&QSPIHandle[Instance], QSPICtx[Instance].InterfaceMode) != MXIC_SNOR_ERROR_NONE)
      {
        ret = BSP_ERROR_COMPONENT_FAILURE;
      }
    }

    /* Update QSPI context if all operations are well done */
    if(ret == BSP_ERROR_NONE)
    {
      QSPICtx[Instance].IsInitialized = QSPI_ACCESS_MMP;
    }
  }
  /* Return BSP status */
  return ret;
}

/**
  * @brief  Exit form memory-mapped mode
  *         Only 1 Instance can running MMP mode. And it will lock system at this mode.
  * @param  Instance  QSPI instance
  * @retval BSP status
  */
uint32_t BSP_QSPI_DisableMemoryMappedMode(uint32_t Instance)
{
  uint32_t ret = BSP_ERROR_NONE;

