daniel-0723/STM32CubeMX/Files/Drivers/QSPI Flash driver/stm32xxx_qspi_MXIC.c
  /* Check if the instance is supported */
  if(Instance >= QSPI_NOR_INSTANCE_NUMBER)
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  else
  {
    if(QSPICtx[Instance].IsInitialized != QSPI_ACCESS_MMP)
    {
      ret = BSP_ERROR_INSTANCE_MMP_UNLOCK_FAILURE;
    }/* Abort MMP back to indirect mode */
    else if(HAL_QSPI_Abort(&QSPIHandle[Instance]) != HAL_OK)
    {
      ret = BSP_ERROR_PERIPH_FAILURE;
    }
    else
    {
      QSPICtx[Instance].IsInitialized = QSPI_ACCESS_INDIRECT;

#ifdef SUPPORT_PERFORMANCE_ENHANCE_READ
      if(MXIC_SNOR_PerformanceEnhanceModeReset(&QSPIHandle[Instance]) != MXIC_SNOR_ERROR_NONE)
      {
        ret = BSP_ERROR_COMPONENT_FAILURE;
      }
#endif  // SUPPORT_PERFORMANCE_ENHANCE_READ

      // Force sampling shift back to half cycle, MMP DTR read finish needed
      QSPIHandle[Instance].Init.SampleShifting = QSPI_SAMPLE_SHIFTING_HALFCYCLE;

      if(HAL_QSPI_Init(&QSPIHandle[Instance])!= HAL_OK)
      {
        ret = BSP_ERROR_PERIPH_FAILURE;
      }
    }
  }
  /* Return BSP status */
  return ret;
}

/**************************************************************************************************
 *  Flash Operation Functions
 *************************************************************************************************/
/**
  * @brief  Get flash ID, 3 Byte
  *         Manufacturer ID, Memory type, Memory density
  * @param  Instance   QSPI instance
  * @retval BSP status
  *         pID        Flash ID;
  *                    pID[31:24] = 0
  *                    pID[23:16] = Memory density
  *                    pID[15:08] = Memory type
  *                    pID[07:00] = Manufacturer ID
  */
uint32_t BSP_QSPI_ReadID(uint32_t Instance, uint32_t *pID)
{
  uint32_t ret = BSP_ERROR_NONE;

  /* Check if the instance is supported */
  if(Instance >= QSPI_NOR_INSTANCE_NUMBER)
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  else
  {
    MXIC_SNOR_CommandHandle_t CommandHandle;

    *pID = 0;               // Clear data
    CommandHandle.Mode    = QSPICtx[Instance].InterfaceMode;
    CommandHandle.pBuffer = (uint8_t *)pID;

#ifdef SUPPORT_QPI
    if((CommandHandle.Mode.IO == MXIC_SNOR_FREAD_444) || (CommandHandle.Mode.IO == MXIC_SNOR_FREAD_444_4DC))
    {
      if(MXIC_SNOR_QPIIDRead(&QSPIHandle[Instance], &CommandHandle) != MXIC_SNOR_ERROR_NONE)
      {
        ret = BSP_ERROR_COMPONENT_FAILURE;
      }
    }
    else
#endif  // SUPPORT_QPI
    {
      if(MXIC_SNOR_ReadID(&QSPIHandle[Instance], &CommandHandle) != MXIC_SNOR_ERROR_NONE)
      {
        ret = BSP_ERROR_COMPONENT_FAILURE;
      }
    }
  }
  /* Return Flash ID or BSP status if an error occurred */
  return ret;
}

/**
  * @brief  Reads an amount of data from the QSPI memory.
  * @param  Instance QSPI instance
  *         pData    Pointer to data to be read
  *         Address  Read start address
  *         Size     Read Size in Byte
  * @retval BSP status
  */
uint32_t BSP_QSPI_Read(uint32_t Instance, uint8_t *pData, uint32_t Address, uint32_t Size)
{
  uint32_t ret = BSP_ERROR_NONE;

  /* Check if the instance is supported */
  if(Instance >= QSPI_NOR_INSTANCE_NUMBER)
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  else
  {
    MXIC_SNOR_CommandHandle_t CommandHandle;

    CommandHandle.Mode    = QSPICtx[Instance].InterfaceMode;
    CommandHandle.Address = Address;
    CommandHandle.Size    = Size;
    CommandHandle.pBuffer = pData;

#ifdef SUPPORT_DTR
    if(CommandHandle.Mode.Rate == MXIC_SNOR_DTR)
    {
      // DTR read, Set sampling shift none
      QSPIHandle[Instance].Init.SampleShifting = QSPI_SAMPLE_SHIFTING_NONE;

      if(HAL_QSPI_Init(&QSPIHandle[Instance])!= HAL_OK)
      {
        ret = BSP_ERROR_PERIPH_FAILURE;
      }
      else if(MXIC_SNOR_ReadDTR(&QSPIHandle[Instance], &CommandHandle) != MXIC_SNOR_ERROR_NONE)
      {
        ret = BSP_ERROR_COMPONENT_FAILURE;
      }

      // DTR read finish, Set sampling shift to half cycle for nonDTR command
      QSPIHandle[Instance].Init.SampleShifting = QSPI_SAMPLE_SHIFTING_HALFCYCLE;

      if(HAL_QSPI_Init(&QSPIHandle[Instance])!= HAL_OK)
      {
        ret = BSP_ERROR_PERIPH_FAILURE;
      }
    }
    else
#endif   // Support STR only
    if(MXIC_SNOR_ReadSTR(&QSPIHandle[Instance], &CommandHandle) != MXIC_SNOR_ERROR_NONE)
    {
      ret = BSP_ERROR_COMPONENT_FAILURE;
    }
  }
  /* Return BSP status */
  return ret;
}

/**
  * @brief  Writes an amount of data to the QSPI memory.
  * @param  Instance QSPI instance
  *         pData    Pointer to data to be writed
  *         Address  Write start address
  *         Size     Write Size in Byte
  * @retval BSP status
  */
uint32_t BSP_QSPI_Write(uint32_t Instance, uint8_t *pData, uint32_t Address, uint32_t Size)
{
  uint32_t ret = BSP_ERROR_NONE;

  /* Check if the instance is supported */
  if(Instance >= QSPI_NOR_INSTANCE_NUMBER)
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  else
  {
    MXIC_SNOR_CommandHandle_t CommandHandle;
    uint32_t end_addr, current_size, current_addr;

    CommandHandle.Mode = QSPICtx[Instance].InterfaceMode;

    /* Initialize the address variables */
    current_addr = Address;
    end_addr     = Address + Size;

    /* Calculation of the size between the write address and the end of the page */
    current_size = MXIC_SNOR_PAGE_SIZE - (Address % MXIC_SNOR_PAGE_SIZE);

    /* Check if the size of the data is less than the remaining place in the page */
    if (current_size > Size)
    {
      current_size = Size;
    }

    /* Perform the write page by page */
    do
    {
      /* Enable write operations */
      if(MXIC_SNOR_WriteEnable(&QSPIHandle[Instance], CommandHandle.Mode) != MXIC_SNOR_ERROR_NONE)
      {
        ret = BSP_ERROR_COMPONENT_FAILURE;
      }
      else /* Issue page program command */
      {
        CommandHandle.Address = current_addr;
        CommandHandle.Size    = current_size;
        CommandHandle.pBuffer = pData;

        if(MXIC_SNOR_PageProgramSTR(&QSPIHandle[Instance], &CommandHandle) != MXIC_SNOR_ERROR_NONE)
        {
          ret = BSP_ERROR_COMPONENT_FAILURE;
        } /* Configure automatic polling mode to wait for end of program */
        else if(MXIC_SNOR_AutoPollingMemReady(&QSPIHandle[Instance], CommandHandle.Mode) != MXIC_SNOR_ERROR_NONE)
        {
          ret = BSP_ERROR_COMPONENT_FAILURE;
        }
      }

      /* Update the address and size variables for next page programming */
      current_addr += current_size;
      pData        += current_size;
      current_size  = ((current_addr + MXIC_SNOR_PAGE_SIZE) > end_addr) ? (end_addr - current_addr) : MXIC_SNOR_PAGE_SIZE;
    } while((current_addr < end_addr) && (ret == BSP_ERROR_NONE));
  }
  /* Return BSP status */
  return ret;
}

/**
  * @brief  Erases the specified address of block
  * @param  Instance  QSPI instance
  *         Address   Block address to erase
  *         Size      Erase Block size
  * @retval BSP status
  */
uint32_t BSP_QSPI_EraseBlock(uint32_t Instance, uint32_t Address, BSP_QSPI_Erase_t Size)
{
  uint32_t ret = BSP_ERROR_NONE;

