daniel-0723/STM32CubeMX/Files/Drivers/QSPI Flash driver/stm32xxx_qspi_MXIC.c
  /* Check if the instance is supported */
  if(Instance >= QSPI_NOR_INSTANCE_NUMBER)
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  else
  {
    MXIC_SNOR_CommandHandle_t CommandHandle;

    CommandHandle.Mode = QSPICtx[Instance].InterfaceMode;

    /* Enable write operations */
    if(MXIC_SNOR_WriteEnable(&QSPIHandle[Instance], CommandHandle.Mode) != MXIC_SNOR_ERROR_NONE)
    {
      ret = BSP_ERROR_COMPONENT_FAILURE;
    }
    else
    {
      /* Issue Block Erase command */
      CommandHandle.Address = Address;
      CommandHandle.Size    = Size;
      if(MXIC_SNOR_BlockErase(&QSPIHandle[Instance], &CommandHandle) != MXIC_SNOR_ERROR_NONE)
      {
        ret = BSP_ERROR_COMPONENT_FAILURE;
      }
      else
      {
        /* Wait Flash ready */
        uint8_t MatchMask[2] = {0, MXIC_SNOR_SR_WIP};

        CommandHandle.pBuffer          = MatchMask;
#ifdef MXIC_SNOR_ERASE_CHIP_CMD
        CommandHandle.Parameter.Type32 = (CommandHandle.Size == MXIC_SNOR_ERASE_CHIP) ? MXIC_SNOR_MAX_TIME_ERASE_CHIP : HAL_QPSI_TIMEOUT_DEFAULT_VALUE;
#else
        CommandHandle.Parameter.Type32 = HAL_QPSI_TIMEOUT_DEFAULT_VALUE;
#endif
        if(MXIC_SNOR_PollingStatusRegister(&QSPIHandle[Instance], &CommandHandle) != MXIC_SNOR_ERROR_NONE)
        {
          ret = BSP_ERROR_COMPONENT_FAILURE;
        }
      }
    }
  }
  /* Return BSP status */
  return ret;
}

#ifdef MXIC_SNOR_ERASE_CHIP_CMD
/**
  * @brief  Erases the entire QSPI memory.
  * @param  Instance  QSPI instance
  * @retval BSP status
  */
uint32_t BSP_QSPI_EraseChip(uint32_t Instance)
{
  uint32_t ret = BSP_ERROR_NONE;

  /* Check if the instance is supported */
  if(Instance >= QSPI_NOR_INSTANCE_NUMBER)
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  else
  {
    MXIC_SNOR_CommandHandle_t CommandHandle;

    CommandHandle.Mode = QSPICtx[Instance].InterfaceMode;

    /* Enable write operations */
    if(MXIC_SNOR_WriteEnable(&QSPIHandle[Instance], CommandHandle.Mode) != MXIC_SNOR_ERROR_NONE)
    {
      ret = BSP_ERROR_COMPONENT_FAILURE;
    } /* Issue Chip Erase command */
    else if(MXIC_SNOR_ChipErase(&QSPIHandle[Instance], CommandHandle.Mode) != MXIC_SNOR_ERROR_NONE)
    {
      ret = BSP_ERROR_COMPONENT_FAILURE;
    }
    else
    {
      /* Wait Flash ready */
      uint8_t MatchMask[2] = {0, MXIC_SNOR_SR_WIP};

      CommandHandle.pBuffer          = MatchMask;
      CommandHandle.Parameter.Type32 = MXIC_SNOR_MAX_TIME_ERASE_CHIP;
      if(MXIC_SNOR_PollingStatusRegister(&QSPIHandle[Instance], &CommandHandle) != MXIC_SNOR_ERROR_NONE)
      {
        ret = BSP_ERROR_COMPONENT_FAILURE;
      }
    }
  }
  /* Return BSP status */
  return ret;
}
#endif  // MXIC_SNOR_ERASE_CHIP_CMD

/**
  * @brief  Read flash status register value
  * @param  Instance  QSPI instance
  * @param  pData     Pointer for retrieve status register value
  * @retval BSP status
  */
uint32_t BSP_QSPI_ReadStatusRegister(uint32_t Instance, MXIC_SNOR_StatusRegister_t *pData)
{
  uint32_t ret = BSP_ERROR_NONE;


  /* Check if the instance is supported */
  if(Instance >= QSPI_NOR_INSTANCE_NUMBER)
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  else
  {
    MXIC_SNOR_CommandHandle_t CommandHandle;

    CommandHandle.Mode    = QSPICtx[Instance].InterfaceMode;
    CommandHandle.pBuffer = (uint8_t *)pData;
    if(MXIC_SNOR_ReadStatusRegister(&QSPIHandle[Instance], &CommandHandle) != MXIC_SNOR_ERROR_NONE)
    {
      ret = BSP_ERROR_COMPONENT_FAILURE;
    }
  }
  /* Return BSP status */
  return ret;
}

#ifdef MXIC_SNOR_WRITE_STATUS_CONFIGURATION_REG_CMD
/**
  * @brief  Write flash status register.
  * @param  Instance QSPI instance
  * @param  Data     Value for write to status register.
  * @retval BSP status
  */
uint32_t BSP_QSPI_WriteStatusRegister(uint32_t Instance, MXIC_SNOR_StatusRegister_t Data)
{
  uint32_t ret = BSP_ERROR_NONE;

  /* Check if the instance is supported */
  if(Instance >= QSPI_NOR_INSTANCE_NUMBER)
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  else
  {
    MXIC_SNOR_CommandHandle_t CommandHandle;

    CommandHandle.Mode = QSPICtx[Instance].InterfaceMode;

    /* Enable write operations */
    if(MXIC_SNOR_WriteEnable(&QSPIHandle[Instance], CommandHandle.Mode) != MXIC_SNOR_ERROR_NONE)
    {
      ret = BSP_ERROR_COMPONENT_FAILURE;
    }
    else
    {
      /* Write Status Register */
      CommandHandle.Size    = sizeof(MXIC_SNOR_StatusRegister_t);
      CommandHandle.pBuffer = (uint8_t *)&Data;
      if(MXIC_SNOR_WriteStatusConfigurationRegister(&QSPIHandle[Instance], &CommandHandle) != MXIC_SNOR_ERROR_NONE)
      {
        ret = BSP_ERROR_COMPONENT_FAILURE;
      } /* Wait Flash ready */
      else if(MXIC_SNOR_AutoPollingMemReady(&QSPIHandle[Instance], CommandHandle.Mode) != MXIC_SNOR_ERROR_NONE)
      {
        ret = BSP_ERROR_COMPONENT_FAILURE;
      }
    }
  }
  /* Return BSP status */
  return ret;
}
#endif  // MXIC_SNOR_WRITE_STATUS_CONFIGURATION_REG_CMD

#ifdef MXIC_SNOR_READ_CONFIGURATION_REG_CMD
/**
  * @brief  Read flash configuration register value
  * @param  Instance  QSPI instance
  *         *pData    Pointer for retrieve Configuration register value
  *         Size      Data size in Byte (Some device support CR & CR2)
  * @retval BSP status
  */
uint32_t BSP_QSPI_ReadConfigurationRegister(uint32_t Instance, uint8_t *pData, uint32_t Size)
{
  uint32_t ret = BSP_ERROR_NONE;


  /* Check if the instance is supported */
  if(Instance >= QSPI_NOR_INSTANCE_NUMBER)
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  else
  {
    MXIC_SNOR_CommandHandle_t CommandHandle;

    CommandHandle.Mode    = QSPICtx[Instance].InterfaceMode;
    CommandHandle.Size    = Size;
      CommandHandle.pBuffer = pData;
    if(MXIC_SNOR_ReadConfigurationRegister(&QSPIHandle[Instance], &CommandHandle) != MXIC_SNOR_ERROR_NONE)
    {
      ret = BSP_ERROR_COMPONENT_FAILURE;
    }
  }

  /* Return BSP status */
  return ret;
}

/**
  * @brief  Write configuration register.
  * @param  Instance  QSPI instance
  * @param  pData     CR, CR2 value for write to configuration register.
  *                   Some device support CR & CR2
  * @retval BSP status
  */
uint32_t BSP_QSPI_WriteConfigurationRegister(uint32_t Instance, uint8_t *pData, uint32_t Size)
{
  uint32_t ret = BSP_ERROR_NONE;

