daniel-0723/STM32CubeMX/Files/Drivers/QSPI Flash driver/stm32xxx_qspi_MXIC.c
  /* Check if the instance is supported */
  if(Instance >= QSPI_NOR_INSTANCE_NUMBER)
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  else
  {
    MXIC_SNOR_CommandHandle_t CommandHandle;

    CommandHandle.Mode    = QSPICtx[Instance].InterfaceMode;
    CommandHandle.Size    = Size;
    CommandHandle.pBuffer = pData;
    if(MXIC_SNOR_WriteConfigurationRegister(&QSPIHandle[Instance], &CommandHandle) != MXIC_SNOR_ERROR_NONE)
    {
      ret = BSP_ERROR_COMPONENT_FAILURE;
    }
  }
  /* Return BSP status */
  return ret;
}
#endif  // MXIC_SNOR_READ_CONFIGURATION_REG_CMD

#ifdef MXIC_SNOR_READ_CONFIGURATION_REG2_CMD
/**
  * @brief  RRead Configuration Register 2
  * @param  Instance  QSPI instance
  *         pData     Buffer pointer
  *         Address   CR2 address
  * @retval BSP status
  *         *pData = CR2 value
  */
uint32_t BSP_QSPI_ReadConfigurationRegister2(uint32_t Instance, uint8_t *pData, uint32_t Address)
{
  uint32_t ret = BSP_ERROR_NONE;

  /* Check if the instance is supported */
  if(Instance >= QSPI_NOR_INSTANCE_NUMBER)
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  else
  {
    MXIC_SNOR_CommandHandle_t CommandHandle;

    CommandHandle.Mode    = QSPICtx[Instance].InterfaceMode;
    CommandHandle.Address = Address;
    CommandHandle.pBuffer = pData;
    if(MXIC_SNOR_ReadConfigurationRegister2(&QSPIHandle, &CommandHandle) != MXIC_SNOR_ERROR_NONE)
    {
      ret = BSP_ERROR_COMPONENT_FAILURE;
    }
  }
  /* Return BSP status */
  return ret;
}
#endif  // MXIC_SNOR_READ_CONFIGURATION_REG2_CMD

#ifdef  MXIC_SNOR_WRITE_CONFIGURATION_REG2_CMD
/**
  * @brief  Write Configuration Register 2
  * @param  Instance QSPI instance
  *         Data     Value for write to CR2
  *         Address  CR2 address
  * @retval BSP status
  */
uint32_t BSP_QSPI_WriteConfigurationRegister2(uint32_t Instance, uint8_t Data, uint32_t Address)
{
  uint32_t ret = BSP_ERROR_NONE;

  /* Check if the instance is supported */
  if(Instance >= QSPI_NOR_INSTANCE_NUMBER)
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  else
  {
    MXIC_SNOR_CommandHandle_t CommandHandle;

    CommandHandle.Mode = QSPICtx[Instance].InterfaceMode;

    /* Enable write operations */
    if(MXIC_SNOR_WriteEnable(&QSPIHandle, CommandHandle.Mode) != MXIC_SNOR_ERROR_NONE)
    {
      ret = BSP_ERROR_COMPONENT_FAILURE;
    }
    else
    {
      /* Write Configuration Register 2 */
      CommandHandle.Address = Address;
      CommandHandle.pBuffer = &Data;
      if(MXIC_SNOR_WriteConfigurationRegister2(&QSPIHandle, &CommandHandle) != MXIC_SNOR_ERROR_NONE)
      {
        ret = BSP_ERROR_COMPONENT_FAILURE;
      } /* Wait Flash ready */
      else if(MXIC_SNOR_AutoPollingMemReady(&QSPIHandle, CommandHandle.Mode) != MXIC_SNOR_ERROR_NONE)
      {
        ret = BSP_ERROR_COMPONENT_FAILURE;
      }
    }
  }

  /* Return BSP status */
  return ret;
}
#endif  // MXIC_SNOR_WRITE_CONFIGURATION_REG2_CMD

/**
  * @brief  This function reset the QSPI Flash memory.
  *         Fore QPI+SPI reset to avoid system come from unknown status.
  *         Flash accept 1-1-1, 1-1-2, 1-2-2 commands after reset.
  * @param  Instance  QSPI instance
  * @retval BSP status
  */
uint32_t BSP_QSPI_ResetMemory(uint32_t Instance)
{
  uint32_t ret = BSP_ERROR_NONE;

  /* Check if the instance is supported */
  if(Instance >= QSPI_NOR_INSTANCE_NUMBER)
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  else
  {
#ifdef MXIC_SNOR_SOFTWARE_RESET_CMD              // Software reset command
    if(MXIC_SNOR_SoftwareReset(&QSPIHandle[Instance]) != MXIC_SNOR_ERROR_NONE)
    {
      ret = BSP_ERROR_COMPONENT_FAILURE;
    }

#elif defined(MXIC_SNOR_RESET_ENABLE_CMD)
    MXIC_SNOR_Mode_t Mode;

#ifdef SUPPORT_QPI      /* Send RESET ENABLE command in QPI mode (QUAD I/Os, 4-0-0) */
    Mode.IO   = MXIC_SNOR_FREAD_444;
    Mode.Rate = MXIC_SNOR_STR;

    if(MXIC_SNOR_ResetEnable(&QSPIHandle[Instance], Mode) != MXIC_SNOR_ERROR_NONE)    // Send Reset Enable by 4-0-0 command
    {
      ret = BSP_ERROR_COMPONENT_FAILURE;
    }
    else if(MXIC_SNOR_ResetMemory(&QSPIHandle[Instance], Mode) != MXIC_SNOR_ERROR_NONE)
    {
      ret = BSP_ERROR_COMPONENT_FAILURE;
    }
#endif  // SUPPORT_QPI

    // 1-1-1 software reset
    if(ret == BSP_ERROR_NONE)
    {
      Mode.IO   = MXIC_SNOR_FREAD_111;
      Mode.Rate = MXIC_SNOR_STR;

      if(MXIC_SNOR_ResetEnable(&QSPIHandle[Instance], Mode) != MXIC_SNOR_ERROR_NONE)    // Send Reset Enable by 1-0-0 command
      {
        ret = BSP_ERROR_COMPONENT_FAILURE;
      }
      else if(MXIC_SNOR_ResetMemory(&QSPIHandle[Instance], Mode) != MXIC_SNOR_ERROR_NONE)
      {
        ret = BSP_ERROR_COMPONENT_FAILURE;
      }
    }

#else   // Hardware Reset
  /* Hardware Reset function place here */
#endif

    if(ret == BSP_ERROR_NONE)
    {
      QSPICtx[Instance].IsInitialized      = QSPI_ACCESS_INDIRECT;  // After reset S/W setting MCU to indirect access
      QSPICtx[Instance].InterfaceMode.IO   = MXIC_SNOR_FREAD_111;   // After reset H/W Flash back to SPI 1-1-1 mode by default
      QSPICtx[Instance].InterfaceMode.Rate = MXIC_SNOR_STR;         // After reset S/W Flash back to STR mode

      /* After S/W reset CMD, wait Reset Recovery time for 1ms. */
      /* The Reset Recovery time may be over 1ms, if reset issued during Flash operating. */
      HAL_Delay(1);
    }
  }
  /* Return BSP status */
  return ret;
}

/******************************************************************************
  * @addtogroup STM32F769I_DISCOVERY_QSPI_Private_Functions
  ****************************************************************************/
/**
  * @brief  Initializes the QSPI interface.
  * @param  hqspi          QSPI handle
  * @param  FlashSize      QSPI flash size
  * @param  ClockPrescaler Clock prescaler
  * @retval BSP status
  */
HAL_StatusTypeDef MX_QSPI_Init(QSPI_HandleTypeDef *hqspi, uint32_t FlashSize, uint32_t ClockPrescaler)
{
  hqspi->Init.ClockPrescaler     = ClockPrescaler;   /* QSPI SCLK freq = AHB MHz/(ClockPrescaler+1) */
  hqspi->Init.FifoThreshold      = 16;
  hqspi->Init.SampleShifting     = QSPI_SAMPLE_SHIFTING_HALFCYCLE;
  hqspi->Init.FlashSize          = POSITION_VAL(FlashSize) - 1;
  hqspi->Init.ChipSelectHighTime = QSPI_CS_HIGH_TIME_4_CYCLE;
  hqspi->Init.ClockMode          = QSPI_CLOCK_MODE_0;
  hqspi->Init.FlashID            = QSPI_FLASH_ID_1;
  hqspi->Init.DualFlash          = QSPI_DUALFLASH_DISABLE;

  return HAL_QSPI_Init(hqspi);
}

/* Private functions ---------------------------------------------------------*/
#ifdef MXIC_SNOR_CR_ODS
/**
  * @brief  This function configure the Output Driver Strength on memory side.
  *         ODS bit located in Configuration Register[2:0] in general
  * @param  Instance  QSPI instance
  * @retval BSP status
  */
static uint32_t QSPI_SetODS(uint32_t Instance, uint8_t ODS)
{
  uint32_t ret = BSP_ERROR_NONE;

