daniel-0723/STM32CubeMX/Files/Drivers/QSPI Flash driver/stm32xxx_qspi_MXIC.c
  /* Check if the instance is supported */
  if(Instance >= QSPI_NOR_INSTANCE_NUMBER)
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  else
  {
    MXIC_SNOR_CommandHandle_t CommandHandle;
    MXIC_SNOR_ConfigurationRegister_t CReg;

    CommandHandle.Mode    = QSPICtx[Instance].InterfaceMode;
    CommandHandle.Size    = 1;
    CommandHandle.pBuffer = (uint8_t *)&CReg;
    if(MXIC_SNOR_ReadConfigurationRegister(&QSPIHandle[Instance], &CommandHandle) != MXIC_SNOR_ERROR_NONE)
    {
      ret = BSP_ERROR_COMPONENT_FAILURE;
    }
    else
    {
      /* Set Output Strength of the QSPI memory as Flash data sheet define */
      CReg.ODS = ODS;
      if(MXIC_SNOR_WriteConfigurationRegister(&QSPIHandle[Instance], &CommandHandle) != MXIC_SNOR_ERROR_NONE)
      {
        ret = BSP_ERROR_COMPONENT_FAILURE;
      }
    }
  }
  /* Return BSP status */
  return ret;
}
#endif  // MXIC_SNOR_CR_ODS

#if defined(MXIC_SNOR_CR_DC) || defined(MXIC_SNOR_CR2_DC)
/**
  * @brief  This function configure the dummy cycles on memory side.
  *         MXIC_SNOR_CR_DC                 : Dummy cycle bit located in Configuration Register[7:6]
  *         SUPPORT_CONFIGURATION_REGISTER2 : Dummy cycle bit located in Configuration Register2 Address 0x00000300[2:0]
  * @param  Instance  OSPI_NOR instance
  *         DCIndex   Dummy Clock index
  * @retval BSP status
  */
static uint32_t QSPI_DummyCyclesCfg(uint32_t Instance, uint8_t DCIndex)
{
  uint32_t ret = BSP_ERROR_NONE;

  /* Check if the instance is supported */
  if(Instance >= QSPI_NOR_INSTANCE_NUMBER)
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  else
  {
#ifdef MXIC_SNOR_CR_DC
    MXIC_SNOR_CommandHandle_t CommandHandle;
    MXIC_SNOR_ConfigurationRegister_t CReg;

    CommandHandle.Mode    = QSPICtx[Instance].InterfaceMode;
    CommandHandle.Size    = 1;
    CommandHandle.pBuffer = (uint8_t *)&CReg;
    if(MXIC_SNOR_ReadConfigurationRegister(&QSPIHandle[Instance], &CommandHandle) != MXIC_SNOR_ERROR_NONE)
    {
      ret = BSP_ERROR_COMPONENT_FAILURE;
    }
    else
    {
      /* Set Dummy Cycle Index of the QSPI memory as Flash data sheet define */
      CReg.DC = DCIndex;
      if(MXIC_SNOR_WriteConfigurationRegister(&QSPIHandle[Instance], &CommandHandle) != MXIC_SNOR_ERROR_NONE)
      {
        ret = BSP_ERROR_COMPONENT_FAILURE;
      }
    }
#else   // CR2
    if(BSP_QSPI_WriteConfigurationRegister2(Instance, DCIndex, CR2_00000300h) != BSP_ERROR_NONE)
    {
      ret = BSP_ERROR_COMPONENT_FAILURE;
    }
#endif  // MXIC_SNOR_CR_DC
  }
   /* Return BSP status */
  return ret;
}
#endif   // defined(MXIC_SNOR_CR_DC) || defined(MXIC_SNOR_CR2_DC)
/************************ (C) COPYRIGHT Macronix **************END OF FILE****/
